In [1]:
import pandas as pd
import string

# **Deleting `pandas` Columns**

In [2]:
df = pd.DataFrame({char:[num] for char,num in 
                   zip(string.ascii_lowercase,
                       range(len(string.ascii_lowercase)))})

In [3]:
df

   a  b  c  d  e  f  g  h  i  j  ...   q   r   s   t   u   v   w   x   y   z
0  0  1  2  3  4  5  6  7  8  9  ...  16  17  18  19  20  21  22  23  24  25

[1 rows x 26 columns]

## **`drop` Method**

In [4]:
df.drop(['a','b'],axis=1,inplace=True)

In [5]:
df

   c  d  e  f  g  h  i  j   k   l  ...   q   r   s   t   u   v   w   x   y   z
0  2  3  4  5  6  7  8  9  10  11  ...  16  17  18  19  20  21  22  23  24  25

[1 rows x 24 columns]

## **`del` Statement**

In [6]:
del df['c']

In [7]:
df

,d,e,f,g,h,i,j,k,l,m,...,q,r,s,t,u,v,w,x,y,z
0,3,4,5,6,7,8,9,10,11,12,...,16,17,18,19,20,21,22,23,24,25

## **`pop` Method**

In [8]:
df.pop('d')

0    3
Name: d, dtype: int64

In [9]:
df

,e,f,g,h,i,j,k,l,m,n,...,q,r,s,t,u,v,w,x,y,z
0,4,5,6,7,8,9,10,11,12,13,...,16,17,18,19,20,21,22,23,24,25

# **Connect**
- **Feel free to connect with Adrian on [YouTube](https://www.youtube.com/channel/UCPuDxI3xb_ryUUMfkm0jsRA), [LinkedIn](https://www.linkedin.com/in/adrian-dolinay-frm-96a289106/), [X](https://twitter.com/DolinayG), [GitHub](https://github.com/ad17171717), [Medium](https://adriandolinay.medium.com/) and [Odysee](https://odysee.com/@adriandolinay:0). Happy coding!**

# **Podcast**

- **Check out Adrian's Podcast, The Aspiring STEM Geek on [YouTube](https://www.youtube.com/@AdrianDolinay/podcasts), [Spotify](https://open.spotify.com/show/60dPNJbDPaPw7ru8g5btxV), [Apple Podcasts](https://podcasts.apple.com/us/podcast/the-aspiring-stem-geek/id1765996824), [Audible](https://www.audible.com/podcast/The-Aspiring-STEM-Geek/B0DC73S9SN?eac_link=MCFKvkxuqKYU&ref=web_search_eac_asin_1&eac_selected_type=asin&eac_selected=B0DC73S9SN&qid=IrZ84nGqvz&eac_id=141-8769271-5781515_IrZ84nGqvz&sr=1-1) and [iHeart Radio](https://www.iheart.com/podcast/269-the-aspiring-stem-geek-202676097/)!**